

// Общий модуль для добавления элементов на форму документов
#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьГруппуНаФорму(Форма);
		ДобавитьРеквизитСкидка(Форма);
		Если Форма.Команды.Найти("КомандаПрименить") = Неопределено Тогда
			ДобавитьКомандуПрименить(Форма);
		КонецЕсли;	
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицо(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицо(Форма);
	КонецЕсли; 

КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Net_КонтактноеЛицо";
	
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицо(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Net_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьРеквизитСкидка(Форма) Экспорт

	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
	ПолеВвода.ПутьКДанным = "Объект.Net_СогласованнаяСкидка";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзмененииСогласованнаяСкидка");
	
КонецПроцедуры  

Процедура ДобавитьКомандуПрименить(Форма) Экспорт
	
	КомандаПрименить = Форма.Команды.Добавить("Применить");
	КомандаПрименить.Заголовок = "Применить";
	КомандаПрименить.Действие = "КомандаПрименить";
	
	КнопкаКоманды = Форма.Элементы.Добавить("КомандаПрименить", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка);
	КнопкаКоманды.ИмяКоманды = "Применить";
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		
КонецПроцедуры 

Процедура ДобавитьГруппуНаФорму(Форма) Экспорт
	
	НоваяГруппа = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	
КонецПроцедуры

#КонецОбласти

